app/controllers/admins/multi_factor_authentication_controller.rb

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 ORDER BY `admins`.`id` ASC LIMIT 1
---
  def set_admin
    @admin = Admin.find(params[:id])