app/controllers/complaint_steps_controller.rb

UPDATE `complaints` SET `c_fullname` = 'wfw qe', `c_age` = 44, `c_gender` = 'ew', `c_address` = 'its adqwfihq fqoifhqoboqigpqogqiopgiheqpig\r\nafihqif\r\nafrica', `c_photo` = 'fqf', `c_details` = 'weo winwpoen\r\nqiegowingeiow\r\nqwfoiqnfqogehggh9hpgh4', `updated_at` = '2017-05-11 08:37:42' WHERE `complaints`.`id` = 6
---
  def update
    @complaint = current_user.complaints.last
    @complaint.update_attributes(complaint_params)