app/controllers/complaints_controller.rb

  def index
    if user_signed_in?
      @complaints = current_user.complaints.all
---
SELECT `complaints`.* FROM `complaints` WHERE `complaints`.`user_id` = 1

  def create
    @complaint = current_user.complaints.new(complaint_params)

    respond_to do |format|
      if @complaint.save(validation: true)
---
INSERT INTO `complaints` (`user_id`, `created_at`, `updated_at`) VALUES (1, '2017-05-10 18:38:08', '2017-05-10 18:38:08')

  def update
    respond_to do |format|
      if @complaint.update(complaint_params)
---
UPDATE `complaints` SET `r_fname` = 'oeboeboq', `r_lname` = 'oeof;wo', `r_age` = '88', `r_gender` = '0', `r_email` = 'wiqd@wag', `r_phone` = '353463235', `r_pincode` = '55555', `r_address` = 'wteeyy 4w', `r_photo` = '45yw', `v_fname` = 'jer', `v_lname` = 'dewf', `v_age` = 55, `v_gender` = 'eeer', `v_phone` = '2759279', `v_email` = 'weg@ge', `v_address` = 'kqjfkwjb', `v_relation` = 'hfl', `v_photo` = 'heflw', `c_fullname` = 'hlwgh iehfwfhwi', `c_age` = 88, `c_gender` = '44', `c_address` = 'wgwa', `c_photo` = 'eh', `c_details` = 'aha', `cm_type` = 'aehrae', `cm_location` = 'aeh', `cm_rfactor` = 'aehr', `cm_details` = 'aeh', `cm_photo` = 'aehr', `complaintid` = '', `updated_at` = '2017-05-11 17:42:29' WHERE `complaints`.`id` = 16

  def destroy
    @complaint.destroy
---
DELETE FROM `complaints` WHERE `complaints`.`id` = 1

  def set_complaint
    @complaint = current_user.complaints.find(params[:id])
---
SELECT  `complaints`.* FROM `complaints` WHERE `complaints`.`user_id` = 1 ORDER BY `complaints`.`id` ASC LIMIT 1